lib/tasks/backfill_user_timestamps.rake

      entries.each do |key, ts|
        if key.start_with?("u:")
          username = key.sub("u:", "")
          user = User.where("lower(username)=?", username).first
        else
          email = key.sub("e:", "")
          user = User.where("lower(email)=?", email).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'john doe') ORDER BY "users"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE (lower(username) = 'test') ORDER BY "users"."id" ASC LIMIT 1