lib/tasks/scrape_pages.rake

  task top_searches: :environment do
    # Get top 5 search queries from logs
    top_queries = SearchLog.group(:query).order("count_id DESC").count("id").keys.first(5)

    # Map queries to URLs to scrape (replace with real sources)
    query_to_urls = {
      "ruby" => [ "https://www.ruby-lang.org/en/documentation/" ],
      "rails" => [ "https://guides.rubyonrails.org/" ],
      "javascript" => [ "https://developer.mozilla.org/en-US/docs/Web/JavaScript" ],
      "arsenal fc" => [ "https://en.wikipedia.org/wiki/Arsenal_F.C." ],
      "world cup" => [ "https://en.wikipedia.org/wiki/FIFA_World_Cup" ]
    }

    top_queries.each do |query|
      urls = query_to_urls[query.downcase]
      next unless urls

      ScraperService.scrape_multiple(urls).each do |data|
        Page.find_or_create_by(url: data[:url]) do |page|
---
SELECT COUNT("search_logs"."id") AS "count_id", "search_logs"."query" AS "search_logs_query" FROM "search_logs" GROUP BY "search_logs"."query" ORDER BY count_id DESC
SELECT "pages".* FROM "pages" WHERE "pages"."url" = 'https://guides.rubyonrails.org/' LIMIT 1