app/controllers/api/search_controller.rb

SELECT "pages"."title", "pages"."title", "pages"."url", "pages"."content" FROM "pages" WHERE ((title ILIKE $1 OR content ILIKE $2)) LIMIT $3  [[nil, "%Hello%"], [nil, "%Hello%"], ["LIMIT", 100]]
SELECT "pages"."title", "pages"."title", "pages"."url", "pages"."content" FROM "pages" LIMIT $1  [["LIMIT", 100]]
---
    def index
      query = params[:q].to_s.strip
      if query.present?
        log_search(query)
        begin
          SEARCH_REQUESTS.increment
        rescue => e
          Rails.logger.warn("Could not increment SEARCH_REQUESTS: #{e.message}")
        end
      end

      pages = if query.present?
        # Optimize search query with limit and select only needed fields
        terms = query.split
        conditions = terms.map { |term| "(title ILIKE :t OR content ILIKE :t)" }.join(" AND ")
        values = { t: "%#{terms.join('%')}%" }

        Page.where(conditions, values)
            .select(Page.primary_key, :title, :url, :content)
            .limit(MAX_RESULTS)
      else
        Page.select(Page.primary_key, :title, :url, :content)
            .limit(MAX_RESULTS)