app/controllers/api/search_controller.rb

SELECT "pages".* FROM "pages" WHERE ((title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%') AND (title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%') AND (title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%') AND (title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%') AND (title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%') AND (title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%') AND (title ILIKE '%What%is%the%learning%curve%for%Dylan?%' OR content ILIKE '%What%is%the%learning%curve%for%Dylan?%'))
SELECT "pages".* FROM "pages" WHERE ((title ILIKE '%java%' OR content ILIKE '%java%'))
---
    def index
      query = params[:q].to_s.strip
      if query.present?
        log_search(query)
        begin
          SEARCH_REQUESTS.increment
        rescue => e
          Rails.logger.warn("Could not increment SEARCH_REQUESTS: #{e.message}")
        end
      end

      pages = if query.present?
        # Optimize search query with limit and select only needed fields
        terms = query.split
        conditions = terms.map { |term| "(title ILIKE :t OR content ILIKE :t)" }.join(" AND ")
        values = { t: "%#{terms.join('%')}%" }

        Page.where(conditions, values)
            .select(Page.primary_key, :title, :url, :content)
            .limit(MAX_RESULTS)
      else
        Page.select(Page.primary_key, :title, :url, :content)
            .limit(MAX_RESULTS)

INSERT INTO "search_logs" ("query", "user_ip", "created_at", "updated_at") VALUES ('java', '::1', '2025-11-26 16:07:38.179185', '2025-11-26 16:07:38.179185') RETURNING "id"
---
    def log_search(query)
      # Async logging to avoid blocking request
      SearchLog.create(query: query, user_ip: request.remote_ip)