app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'Omanse' LIMIT 1
---
    def login
      user = User.find_by(username: params[:username])

INSERT INTO "users" ("username", "email", "password", "password_digest", "force_password_reset") VALUES ('maksyuze456', 'maksyuze456@gmail.com', NULL, '$2a$12$UumjVucIO8GsGk3sbjmrHe3l/W/l1JASUVyU6aaNzW7c4aVFcsMvy', NULL) RETURNING "id"
---
    def register
      user = User.new(
        username: params[:username],
        email: params[:email],
        password: params[:password],
        password_confirmation: params[:password_confirmation]
      )

      if user.save