app/controllers/api/users_controller.rb

UPDATE "users" SET "last_login" = $1 WHERE "users"."id" = $2  [["last_login", "2025-11-27 13:00:56.117395"], ["id", 152]]
---
    def login
      user = User.find_by(username: params[:username])
      if user&.authenticate(params[:password])
        session[:user_id] = user.id
        Rails.logger.info("Login success via Api::UsersController for user=#{user.username} id=#{user.id}")
        USER_LOGINS.increment(labels: { status: "success" })

INSERT INTO "users" ("username", "email", "password", "password_digest", "force_password_reset", "last_login", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def register
      user = User.new(
        username: params[:username],
        email: params[:email],
        password: params[:password],
        password_confirmation: params[:password_confirmation]
      )

      if user.save