app/controllers/api/weather_controller.rb

  def show
    city = params[:city] || "Copenhagen"
    api_key = ENV.fetch("OPENWEATHER_API_KEY")

    begin
      response = self.class.get("/weather", query: { q: city, appid: api_key, units: "metric" })
    rescue => e
      Rails.logger.error("Weather API request failed: #{e.message}")
      response = nil
    end

    # log API weather request
    begin
      WeatherSearch.create(city: city, user_ip: request.remote_ip)
---
INSERT INTO "weather_searches" ("city", "user_ip", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["city", "Copenhagen"], ["user_ip", "127.0.0.1"], ["created_at", "2025-12-05 14:54:45.856560"], ["updated_at", "2025-12-05 14:54:45.856560"]]