app/controllers/test/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "password_digest", "force_password_reset") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "testuser_43ea17d6"], ["email", "[FILTERED]"], ["password", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["force_password_reset", "[FILTERED]"]]
---
    def register
      data = JSON.parse(request.body.read) rescue {}
      user = User.new(
        username: data["username"],
        email: data["email"],
        password: data["password"],
        password_confirmation: data["password_confirmation"]
      )

      if user.save

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "testuser_c507aef7"], ["LIMIT", 1]]
UPDATE "users" SET "last_login" = $1 WHERE "users"."id" = $2  [["last_login", "2025-11-27 12:56:40.105269"], ["id", 145]]
---
    def login
      data = JSON.parse(request.body.read) rescue {}
      user = User.find_by(username: data["username"])

      if user&.authenticate(data["password"])
        session[:user_id] = user.id
        Rails.logger.info("Login success via Test::UsersController for user=#{user.username} id=#{user.id}")
        USER_LOGINS.increment(labels: { status: "success" })