app/controllers/metrics_controller.rb

  def index
    # Update user registrations gauge dynamically
    begin
      USER_REGISTRATIONS.set(User.count) if USER_REGISTRATIONS.respond_to?(:set)
---
SELECT COUNT(*) FROM "users"