app/controllers/passwords_controller.rb

  def edit
    redirect_to login_path unless session[:user_id]
    flash.clear
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1

  def update
    @user = User.find(session[:user_id])

    if @user.update(password_params.merge(force_password_reset: false))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
UPDATE "users" SET "password_digest" = '$2a$12$wHf8eJUAWkMi3tBIqEtfpebHWbHz/fvh5PL2bOkoFQ8604mpm3w3C', "force_password_reset" = FALSE WHERE "users"."id" = 5