app/controllers/passwords_controller.rb

  def update
    @user = User.find(session[:user_id])

    if @user.update(password_params.merge(force_password_reset: false))
---
UPDATE "users" SET "password_digest" = $1, "force_password_reset" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "[FILTERED]"], ["force_password_reset", "[FILTERED]"], ["updated_at", "2025-12-12 10:11:00.200147"], ["id", 760]]