app/controllers/users_controller.rb

  def index
    users = User.all
---
SELECT "users".* FROM "users"

  def show
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def create
    data = request.request_parameters.presence || JSON.parse(request.body.read) rescue {}
    user = User.new(
      username: data["username"],
      email: data["email"],
      password: data["password"],
      password_confirmation: data["password_confirmation"]
    )

    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "John Doe"], ["email", "[FILTERED]"], ["password_digest", "[FILTERED]"]]