app/controllers/users_controller.rb

  def login
    data = JSON.parse(request.body.read) rescue {}
    user = User.find_by(username: data["username"])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'omar' LIMIT 1

  def create
    data = request.request_parameters.presence || JSON.parse(request.body.read) rescue {}
    user = User.new(
      username: data["username"],
      email: data["email"],
      password: data["password"],
      password_confirmation: data["password_confirmation"]
    )

    if user.save
---
INSERT INTO "users" ("username", "email", "password", "password_salt", "password_digest") VALUES ('Omar', 'omaralali12@hotmail.com', NULL, NULL, '$2a$12$dnYP4knDSPg94PeUCAiPfeDxH3jL.dzDHK0MNjdCZxr/RNnPB3yyC') RETURNING "id"

  def register
    data = JSON.parse(request.body.read) rescue {}
    user = User.new(
      username: data["username"],
      email: data["email"],
      password: data["password"],
      password_confirmation: data["password_confirmation"]
    )

    if user.save
---
INSERT INTO "users" ("username", "email", "password", "password_salt", "password_digest") VALUES ('Omar', 'omaralali12@hotmail.com', NULL, NULL, '$2a$12$dnYP4knDSPg94PeUCAiPfeDxH3jL.dzDHK0MNjdCZxr/RNnPB3yyC') RETURNING "id"