app/controllers/weather_controller.rb

  def index
    city = params[:city] || "Copenhagen"
    api_key = ENV.fetch("OPENWEATHER_API_KEY")

    # log the weather page search in dedicated table
    begin
      WeatherSearch.create(city: city, user_ip: request.remote_ip)
---
INSERT INTO "weather_searches" ("city", "user_ip", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["city", "Copenhagen"], ["user_ip", "127.0.0.1"], ["created_at", "2025-11-27 19:31:35.479829"], ["updated_at", "2025-11-27 19:31:35.479829"]]